added diagrams
